In [2]:
from datascience import *
import numpy as np

%matplotlib inline
import matplotlib.pyplot as plots
plots.style.use('fivethirtyeight')

## Words of Caution ##
- Remember to run the cell above. It's for setting up the environment so you can have access to what's needed for this lecture. For now, don't worry about what it means: we'll learn more about what's inside of it in the next few lectures.
- Data science is not just about code, so please don't go over this notebook by itself. Have the relevant textbook sections at hand so that you can go over the discussion along with the code. Thank you!

In [ ]:
#Control+enter runs a cell 

#expressions are any single line of code

## Python ##

In [ ]:
# We can add numbers
2 + 9

In [ ]:
# We can multiple numbers
2 * 9

In [ ]:
# python can divide numbers
2 / 9

In [1]:
# It must follow the order of operations: PEMDAS 
2 + 3 * 9

29

In [2]:
# There is a difference of operations
(2 + 3) * 9

45

In [ ]:
# two to the power of four: 2 * 2 * 2 * 2
2 ** 4

In [ ]:
#string type 
'hello'

## Names ##

In [ ]:
# we can declare a variable
a = 4

In [ ]:
# and call it
a

In [2]:
# declare another variable
b = 9

In [3]:
# call it again
b

9

In [4]:
# the variable represents the number that it stores
a * 3

NameError: name 'a' is not defined

In [ ]:
# for example a plus b is 
total = a + b

In [ ]:
# the total is a +b
total

In [ ]:
# lets redefine a and the try the operation again 
a = 10

In [ ]:
# the total has not updated because we have not re-evaluated the total line. Python only understands what happens sequentially

total

In [ ]:
# now call the new assignment now that a has changed
total = a + b

In [ ]:
# the new total is ...
total

In [ ]:
'total'

### Why Names?

In [ ]:
# variables allow us to save information
# by naming variables relevant names we can manipulate data
# for example suppose we have hours per week and weeks per year
# and we want to find the number of hours worked per year

hours_per_week = 40
weeks_per_year = 52

In [ ]:
# lets multiply them together and get the the hoours per year

hours_per_year = hours_per_week * weeks_per_year

In [ ]:
hours_per_year

In [3]:
# Minimum wage for businesses w/26 or more employees
# Goes up by $1/hr until 2022
# lets calculate how much we would make in a year

ga_hourly_minimum_wage = 5.15

In [ ]:
# first we will caclulate the pay in a week
weekly_wages = hours_per_week * ca_hourly_minimum_wage
weekly_wages

In [ ]:
# then we will calculate the pay in a year
yearly_wages = hours_per_year * ca_hourly_minimum_wage
yearly_wages

In [ ]:
# lets check
40 * 13.00

In [ ]:
# they match
40 * 52 * 13.00

## Functions and Call Expressions

In [ ]:
# Python also has built in functions that we use and introduc throughout the semester
# for example we have the absolute value function abs
# the input is any number the output is the absolute value

#abs(argument)
#input : integer
# output : absolute value 

abs(-5)

In [ ]:
# We can compose this function with operations
abs(1 - 3)

In [ ]:
# for example suppose we wanted the difference between the day and night tempartures
# lets make up some numbers for these times
# then

day_temp = 52
night_temp = 47
abs(night_temp - day_temp)

In [ ]:
# in the slides we saw the max function, but there is also a min function that returns the 
# smallest value between numbers

min(14, 15)

In [ ]:
# one more lets introduce the round function 

round(123.456)

In [ ]:
round(123.456, 1)

In [ ]:
round(123.456, ndigits=1)

## Tables ##

In [3]:
cones = Table.read_table('cones.csv')
cones

Flavor     | Color       | Price
strawberry | pink        | 3.55
chocolate  | light brown | 4.75
chocolate  | dark brown  | 5.25
strawberry | pink        | 5.25
chocolate  | dark brown  | 5.25
bubblegum  | pink        | 4.75

In [4]:
cones.show(3)

In [5]:
cones.show()

In [6]:
# with select we can pick out columns from are table
cones.select('Flavor')

Flavor
strawberry
chocolate
chocolate
strawberry
chocolate
bubblegum

In [7]:
# we can select more then one column
cones.select('Flavor', 'Price')

Flavor     | Price
strawberry | 3.55
chocolate  | 4.75
chocolate  | 5.25
strawberry | 5.25
chocolate  | 5.25
bubblegum  | 4.75

In [8]:
# However the labels must be a string otherwise, we obtain errors 
cones.select(Flavor, 'Price')

NameError: name 'Flavor' is not defined

In [9]:
# Alternatively we are able to drop tables with the drop method. 
cones.drop('Price')

Flavor     | Color
strawberry | pink
chocolate  | light brown
chocolate  | dark brown
strawberry | pink
chocolate  | dark brown
bubblegum  | pink

In [10]:
# Nothing has happened to the orginal table! Because we did not save any updates to a name
cones

Flavor     | Color       | Price
strawberry | pink        | 3.55
chocolate  | light brown | 4.75
chocolate  | dark brown  | 5.25
strawberry | pink        | 5.25
chocolate  | dark brown  | 5.25
bubblegum  | pink        | 4.75

In [11]:
# Lets drop the price column and save the resulting table 
cones_without_price = cones.drop('Price')
cones_without_price

Flavor     | Color
strawberry | pink
chocolate  | light brown
chocolate  | dark brown
strawberry | pink
chocolate  | dark brown
bubblegum  | pink

In [12]:
# Finally we are able to identify specfic indivuals with a certion 
# characteristic using where

# for example lets find only the icream that is a chocolate flavor 
cones.where('Flavor', 'chocolate')

Flavor    | Color       | Price
chocolate | light brown | 4.75
chocolate | dark brown  | 5.25
chocolate | dark brown  | 5.25

In [13]:
# The last function we will introduce today is sort. 
# At times it is useful to order numerical data. 
# in this case if we have a table we are able to do so using sort. 

#Sort sorts data from highest to lowest where you indicate the price
# For example lets sort the icream from lowest price to highest price

cones.sort('Price')

Flavor     | Color       | Price
strawberry | pink        | 3.55
chocolate  | light brown | 4.75
bubblegum  | pink        | 4.75
chocolate  | dark brown  | 5.25
strawberry | pink        | 5.25
chocolate  | dark brown  | 5.25

In [14]:
# If we are sorting from highest to lowest, we must include the following extra argument
#sort('column_name',descending = True)
cones.sort('Price', descending=True)

Flavor     | Color       | Price
chocolate  | dark brown  | 5.25
strawberry | pink        | 5.25
chocolate  | dark brown  | 5.25
chocolate  | light brown | 4.75
bubblegum  | pink        | 4.75
strawberry | pink        | 3.55

In [15]:
cones.sort('Flavor', descending=True)

Flavor     | Color       | Price
strawberry | pink        | 3.55
strawberry | pink        | 5.25
chocolate  | light brown | 4.75
chocolate  | dark brown  | 5.25
chocolate  | dark brown  | 5.25
bubblegum  | pink        | 4.75

### A more interesting table

In [16]:
skyscrapers = Table.read_table('skyscrapers.csv')
skyscrapers

# Here we have a data set of skyscrappers in the USA
# Lets finf the largest skyscrapper in Altanta

name                              | material  | city          | height | completed
One World Trade Center            | composite | New York City | 541.3  | 2014
Willis Tower                      | steel     | Chicago       | 442.14 | 1974
432 Park Avenue                   | concrete  | New York City | 425.5  | 2015
Trump International Hotel & Tower | concrete  | Chicago       | 423.22 | 2009
Empire State Building             | steel     | New York City | 381    | 1931
Bank of America Tower             | composite | New York City | 365.8  | 2009
Stratosphere Tower                | concrete  | Las Vegas     | 350.22 | 1996
Aon Center                        | steel     | Chicago       | 346.26 | 1973
John Hancock Center               | steel     | Chicago       | 343.69 | 1969
WITI TV Tower                     | steel     | Shorewood     | 329    | 1962
... (190 rows omitted)

In [20]:
atl=skyscrapers.where('city', 'Atlanta')

In [21]:
atl.sort('height',descending = True)

name                   | material  | city    | height | completed
Bank of America Plaza  | composite | Atlanta | 311.8  | 1992
SunTrust Plaza         | concrete  | Atlanta | 264.25 | 1992
One Atlantic Center    | composite | Atlanta | 249.94 | 1987
191 Peachtree Tower    | composite | Atlanta | 234.7  | 1992
Westin Peachtree Plaza | concrete  | Atlanta | 220.37 | 1976
AT&T Building          | concrete  | Atlanta | 206.35 | 1980
Sovereign              | concrete  | Atlanta | 202.69 | 2008
1180 Peachtree         | concrete  | Atlanta | 200.16 | 2006

In [ ]:
skyscrapers.where('city', 'New York City').sort('completed')

In [ ]:
skyscrapers.where('city', 'New York City').sort('completed', descending=True)